// Напишите программу, которая на вход принимает одно число (N), а на выходе 
// показывает все целые числа в промежутке от -N до N

Console.WriteLine("Введите число N: ");
int N = int.Parse(Console.ReadLine());
if (a < 0)
int i=-N;
while (i <= N)
{
    Console.WriteLine(i);
    i++;
}